[M_Orchid_PlotMission04 MissionDefinition]
MissionName="Two easy parts"
MissionDescription="Scarlett says that there is only one way to find Captain Blade's treasure: you must collect the four pieces of the screen and put them back together. If you do, the compass will point you in the direction of the lost treasure (it's not clear how). Scarlett has a place, but you have to find it.<br>To do this, Scarlet tells him to find and kill the Sandman. Note that this is not because he is a leader, but because he has a sharp compass. It's somewhere [place]Enemy madness[-place]."
TurnInDescription="Scarlett has Captain Blade's compass. Thanks to the work of the Sandman and Hyperion teams in finding the other two parts, the only parts that are available so far. The best part: you can't find the treasure in the sand until you reset the compass.."
MissionSummary="Find both parts of the Boss Blade.."
MissionGiver="Captain Scarlett"
MissionTurnInLocation="Captain Scarlet"
TeaserText=""

[M_Orchid_PlotMission04:DestroyCaravans MissionObjectiveDefinition]
ProgressMessage="hang on"

[M_Orchid_PlotMission04:GetCompassPiece MissionObjectiveDefinition]
ProgressMessage="Find the other side of the compass."

[M_Orchid_PlotMission04:GetSandmanCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Scarlett says that there is only one way to find Captain Blade's treasure: collect and return Blade's four compasses. After doing this, the compass will point to the missing treasure (not sure how). Scarlett does, but she wants someone else to be there for you. Now that you've defeated Sandman and found his compass, you're close to Captain Blade's lost treasure.."

[M_Orchid_PlotMission04:KillBigSleep MissionObjectiveDefinition]
ProgressMessage="kill the murderer"

[M_Orchid_PlotMission04:KillBothSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission04:KillPirateMinions MissionObjectiveDefinition]
ProgressMessage="Download the game friends of the sand"

[M_Orchid_PlotMission04:KillRivalPirates MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission04:KillSandman MissionObjectiveDefinition]
ProgressMessage="Kill sand"

[M_Orchid_PlotMission04:KillSandmanSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission04:Opengate MissionObjectiveDefinition]
ProgressMessage="Open the door"

[M_Orchid_PlotMission04:OpenGateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission04:ProveYourself MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_PlotMission04:RaidCaravanSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="According to Scarlett, there is only one way to find Captain Blade's treasure: collect the four pieces of Blade's compass and put them together. If you do this, the compass will show you the missing property (I don't know how). Scarlett has such a role, but she needs to know more.<br><br>A third location can be found by exploring the second part of the Sandman Camp campus. According to Sandman Diaries, Episode III will deliver supplies to Hyperion [place]water lotion[-place]. Scarlett asks him to fix a car and find a compass."

[M_Orchid_PlotMission04:StealItem MissionObjectiveDefinition]
ProgressMessage="Part of Hyperion's journey"

[M_Orchid_PlotMission04:TEMPGetItemSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

